In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv')

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
ukupno = titanic['PassengerId'].value_counts().sum()
prezivjeli = titanic['Survived'].value_counts().sum()
preminuli = titanic['PassengerId'].value_counts().sum() - prezivjeli
print(prezivjeli)
print(preminuli)

891
0

week1[week1['Customer ID'] == 155]

In [12]:
titanic[titanic['Survived'] == 0].value_counts().sum()

np.int64(60)

In [13]:
titanic[titanic['Survived'] == 1].value_counts().sum()

np.int64(123)

In [15]:
broj_putnika = titanic['PassengerId'].count()
prezivjeli = titanic['Survived'].sum()
stradali = broj_putnika - prezivjeli
print(broj_putnika)
print(prezivjeli)
print(stradali)

891
342
549

In [16]:
proc_prezivjeli = (prezivjeli / broj_putnika) * 100
print(proc_prezivjeli)

38.38383838383838

In [17]:
titanic['Age'].mean()

np.float64(29.69911764705882)

In [18]:
titanic['Age'].median()

np.float64(28.0)

In [20]:
ukupno = titanic.shape[0] * titanic.shape[1]
broj_n = titanic.isnull().sum().sum()
iznos = broj_n/ukupno*100
iznos

np.float64(8.099513655069211)

grupa = df.groupby('Kategorija')
grupa.sum()

In [ ]:
grupa = titanic['Survived'].groupby('Pclass').sum()
print(grupa)

In [32]:
titanic['Sex'].value_counts(normalize=True)*100

Sex
male      64.758698
female    35.241302
Name: proportion, dtype: float64

In [33]:
titanic['Survived'].value_counts(normalize=True)*100

Survived
0    61.616162
1    38.383838
Name: proportion, dtype: float64

In [34]:
i = titanic['Age'].idxmax()
titanic.loc[i]

PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                            80.0
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                           30.0
Cabin                                           A23
Embarked                                          S
Name: 630, dtype: object

In [35]:
i = titanic['Age'].idxmin()
titanic.loc[i]

PassengerId                                804
Survived                                     1
Pclass                                       3
Name           Thomas, Master. Assad Alexander
Sex                                       male
Age                                       0.42
SibSp                                        0
Parch                                        1
Ticket                                    2625
Fare                                    8.5167
Cabin                                      NaN
Embarked                                     C
Name: 803, dtype: object

grupirano_po_dobnoj_skupini = df.groupby('DobnaSkupina')['Igračke'].sum()
grupirano_po_dobnoj_skupini

In [ ]:
zene_muskarci = titanic.groupby('Sex')['Survived'].sum()
zene_muskarci

Sex
female    233
male      109
Name: Survived, dtype: int64

In [46]:
broj_putnika_klasa = titanic['Pclass'].value_counts()
broj_putnika_klasa

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [48]:
prezivjeli_po_klasi = titanic.groupby('Pclass')['Survived'].sum() / titanic['PassengerId'].count() * 100
prezivjeli_po_klasi

Pclass
1    15.263749
2     9.764310
3    13.355780
Name: Survived, dtype: float64

In [49]:
i = titanic['Fare'].idxmin()
titanic.loc[i]

PassengerId                    180
Survived                         0
Pclass                           3
Name           Leonard, Mr. Lionel
Sex                           male
Age                           36.0
SibSp                            0
Parch                            0
Ticket                        LINE
Fare                           0.0
Cabin                          NaN
Embarked                         S
Name: 179, dtype: object

In [50]:
i = titanic['Fare'].idxmax()
titanic.loc[i]

PassengerId                 259
Survived                      1
Pclass                        1
Name           Ward, Miss. Anna
Sex                      female
Age                        35.0
SibSp                         0
Parch                         0
Ticket                 PC 17755
Fare                   512.3292
Cabin                       NaN
Embarked                      C
Name: 258, dtype: object

In [51]:
prosjecna_cijena = titanic.groupby('Pclass')['Fare'].mean()
prosjecna_cijena

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [52]:
titanic['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [59]:
prosjecna_starost = titanic.groupby('Survived')['Age'].mean()
prosjecna_starost

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [60]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
rodbina = titanic[titanic['PassengerId'] & (titanic['SibSp'].value_counts() > 0 | titanic['Parch'].value_counts()>0)]
rodbina